; domain
(define (domain miconic)
  (:requirements :typing :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-prob-3f-3p)
  (:domain miconic)

  (:objects
    p1 p2 p3 - passenger
    f1 f2 f3 - floor
  )

  (:init
    (origin p1 f1)
    (destin p1 f3)
    (not-boarded p1)
    (not-served p1)
    (origin p2 f2)
    (destin p2 f3)
    (not-boarded p2)
    (not-served p2)
    (origin p3 f3)
    (destin p3 f2)
    (not-boarded p3)
    (not-served p3)
    (above f1 f2)
    (above f1 f3)
    (above f2 f3)
    (lift-at f2)
  )

  (:goal (and
    (served p1)
    (served p2)
    (served p3)
  ))
)

; plan
1. (board f2 p2)
   added: (boarded p2)
   goals met: 0 of 3
2. (down f2 f1)
   deleted: (lift-at f2)
   added: (lift-at f1)
   goals met: 0 of 3
3. (board f1 p1)
   added: (boarded p1)
   goals met: 0 of 3
4. (up f1 f3)
   deleted: (lift-at f1)
   added: (lift-at f3)
   goals met: 0 of 3
5. (depart f3 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 3
6. (board f3 p3)
   added: (boarded p3)
   goals met: 1 of 3
7. (depart f3 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 2 of 3
8. (down f3 f2)
   deleted: (lift-at f3)
   added: (lift-at f2)
   goals met: 2 of 3
9. (depart f2 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 3 of 3
